//=============================================================================
//
// 障害物クラス　(obstacle.cpp)
// Author : 香月瑞輝
//
//=============================================================================

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <assert.h>

#include "obstacle.h"

//*****************************************************************************
// 定数定義
//*****************************************************************************
namespace
{
const int MODEL_TYPE = 1;				// モデルの種類
const int POP_INTERVAL = 120;			// 出現の間隔
const float MOVE_SPEED = 2.5f;			// 移動速度
const float POP_POS_Z = -1500.0f;		// 出現のZの位置
const float RELEASE_POS_Z = 1500.0f;	// 解放のZの位置
const D3DXVECTOR2 POP_POS_X[] =			// 出現のXの位置
{
	D3DXVECTOR2(-60.0f, -30.0f),
	D3DXVECTOR2(-60.0f, 0.0f),
	D3DXVECTOR2(-60.0f, 30.0f),
	D3DXVECTOR2(-60.0f, 60.0f),
	D3DXVECTOR2(-30.0f, 0.0f),
	D3DXVECTOR2(-30.0f, 30.0f),
	D3DXVECTOR2(-30.0f, 60.0f),
	D3DXVECTOR2(0.0f, 30.0f),
	D3DXVECTOR2(0.0f, 60.0f),
	D3DXVECTOR2(30.0f, 60.0f),
};
const int POP_MAX = sizeof(POP_POS_X) / sizeof(POP_POS_X[0]);	// 出現位置の最大数
}

//*****************************************************************************
// 静的メンバ変数宣言
//*****************************************************************************
int CObstacle::m_time = 0;

//=============================================================================
// 出現
//=============================================================================
void CObstacle::Pop()
{
	m_time++;

	if (m_time % POP_INTERVAL == 0)
	{
		int randam = rand() % POP_MAX;

		Create(POP_POS_X[randam].x);
		Create(POP_POS_X[randam].y);
	}
}

//=============================================================================
// 生成
//=============================================================================
CObstacle* CObstacle::Create(float posX)
{
	// オブジェクトインスタンス
	CObstacle* pObstacle = new CObstacle;

	// メモリの確保ができなかった
	assert(pObstacle != nullptr);

	// 初期化
	pObstacle->Init();

	// 位置の設定
	pObstacle->SetPos(D3DXVECTOR3(posX, 0.0f, POP_POS_Z));

	// インスタンスを返す
	return pObstacle;
}

//=============================================================================
// コンストラクタ
//=============================================================================
CObstacle::CObstacle()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CObstacle::~CObstacle()
{
}

//=============================================================================
// 初期化
//=============================================================================
HRESULT CObstacle::Init()
{
	// 初期化
	CModelObj::Init();

	// 種類の設定
	CModelObj::SetType(MODEL_TYPE);

	return E_NOTIMPL;
}

//=============================================================================
// 終了
//=============================================================================
void CObstacle::Uninit()
{
	// 終了
	CModelObj::Uninit();
}

//=============================================================================
// 更新
//=============================================================================
void CObstacle::Update()
{
	// 位置の取得
	D3DXVECTOR3 pos = CModelObj::GetPos();

	pos.z += MOVE_SPEED;

	// 位置の設定
	CModelObj::SetPos(pos);

	if (pos.z >= RELEASE_POS_Z)
	{// 解放する位置を越した
		Uninit();
		return;
	}

	// 更新
	CModelObj::Update();
}

//=============================================================================
// 描画
//=============================================================================
void CObstacle::Draw()
{
	// 描画
	CModelObj::Draw();
}
