///=============================================================================
//
// タイムクラス(time.cpp)
// Author : 唐﨑結斗
// 概要 : タイムの設定を行う
//
//=============================================================================

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <assert.h>
#include <math.h>

#include "time.h"
#include "object.h"
#include "object2D.h"
#include "score.h"
#include "renderer.h"
#include "application.h"
#include "texture.h"
#include "game.h"

//=============================================================================
// インスタンス生成
// Author : 唐﨑結斗
// 概要 : スコアを生成する
//=============================================================================
CTime *CTime::Create()
{
	// オブジェクトインスタンス
	CTime *pTime = nullptr;

	pTime = new CTime;

	// メモリの確保ができなかった
	assert(pTime != nullptr);

	// 数値の初期化
	pTime->Init();

	// インスタンスを返す
	return pTime;
}

//=============================================================================
// コンストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス生成時に行う処理
//=============================================================================
CTime::CTime(int nPriority /*= CObject::PRIORITY_LEVEL3*/) : CObject(nPriority)
{
	m_pObject2D = nullptr;								// 2Dオブジェクト
	m_pScore = nullptr;									// スコア
	m_pos = D3DXVECTOR3(0.0f, 0.0f, 0.0f);				// 位置
	m_posOld = D3DXVECTOR3(0.0f, 0.0f, 0.0f);			// 過去の位置
	m_rot = D3DXVECTOR3(0.0f, 0.0f, 0.0f);				// 向き
	m_size = D3DXVECTOR3(0.0f, 0.0f, 0.0f);				// 大きさ
}

//=============================================================================
// デストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス終了時に行う処理
//=============================================================================
CTime::~CTime()
{

}

//=============================================================================
// 初期化
// Author : 唐﨑結斗
// 概要 : 頂点バッファを生成し、メンバ変数の初期値を設定
//=============================================================================
HRESULT CTime::Init()
{
	// 2Dオブジェクトの生成
	m_pObject2D = CObject2D::Create();
	assert(m_pObject2D != nullptr);
	m_pObject2D->LoadTex(-1);
	m_pObject2D->SetCol(D3DXCOLOR(0.7f, 0.7f, 0.7f, 1.0f));

	// スコアの生成
	m_pScore = CScore::Create(6, true);
	assert(m_pScore != nullptr);
	m_pScore->SetScore(0);

	// 大きさの設定
	SetSize(D3DXVECTOR3(100.0f, 100.0f, 0.0f));

	// 位置の設定
	SetPos(D3DXVECTOR3(640.0f, 360.0f, 0.0f));

	// 向きの設定
	SetRot(D3DXVECTOR3(0.0f, 0.0f, 0.0f));

	return S_OK;
}

//=============================================================================
// 終了
// Author : 唐﨑結斗
// 概要 : テクスチャのポインタと頂点バッファの解放
//=============================================================================
void CTime::Uninit()
{
	m_pScore->Uninit();

	// インスタンスの解放
	Release();
}

//=============================================================================
// 更新
// Author : 唐﨑結斗
// 概要 : 更新を行う
//=============================================================================
void CTime::Update()
{
	// 時間の取得
	int nTime = GetTime();

	// デクリメント
	nTime--;

	if (nTime <= 0)
	{
		nTime = 0;
		CGame::SetGame(false);
	}

	// 時間の設定
	SetTime(nTime);
}

//=============================================================================
// 描画
// Author : 唐﨑結斗
// 概要 : 描画を行う
//=============================================================================
void CTime::Draw()
{
	
}

//=============================================================================
// 位置のセッター
// Author : 唐﨑結斗
// 概要 : 位置のメンバ変数に引数を代入
//=============================================================================
void CTime::SetPos(const D3DXVECTOR3 &pos)
{
	m_pos = pos;

	m_pObject2D->SetPos(m_pos);
	m_pScore->SetPos(m_pos);
}

//=============================================================================
// 向きのセッター
// Author : 唐﨑結斗
// 概要 : 向きのメンバ変数に引数を代入
//=============================================================================
void CTime::SetRot(const D3DXVECTOR3 &rot)
{
	m_rot = rot;

	m_pObject2D->SetRot(m_rot);
	m_pScore->SetRot(m_rot);
}

//=============================================================================
// 大きさのセッター
// Author : 唐﨑結斗
// 概要 : 大きさのメンバ変数に引数を代入
//=============================================================================
void CTime::SetSize(const D3DXVECTOR3 & size)
{
	m_size = size;

	m_pObject2D->SetSize(m_size);
	m_pScore->SetWholeSize(D3DXVECTOR3(m_size.x, size.y / 3.0f, size.z));
	m_pScore->SetSize(D3DXVECTOR3(m_size.x / 3.0f, size.y / 3.0f, size.z));
}

//=============================================================================
// 大きさのセッター
// Author : 唐﨑結斗
// 概要 : 大きさのメンバ変数に引数を代入
//=============================================================================
void CTime::SetTime(const int nTime)
{// 時間の設定
	m_nTime = nTime;

	// スコアの設定
	m_pScore->SetScore(m_nTime);
	m_pScore->AddScore(m_nTime);
}
