//=============================================================================
//
// タイトルクラス(title.cpp)
// Author : 唐﨑結斗
// 概要 : タイトルクラスの管理を行う
//
//=============================================================================

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <assert.h>

#include "title.h"

#include "application.h"
#include "keyboard.h"
#include "debug_proc.h"
#include "joypad.h"
#include "sound.h"

//=============================================================================
// コンストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス生成時に行う処理
//=============================================================================
CTitle::CTitle()
{

}

//=============================================================================
// デストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス終了時に行う処理
//=============================================================================
CTitle::~CTitle()
{

}

//=============================================================================
// 初期化
// Author : 唐﨑結斗
// 概要 : 頂点バッファを生成し、メンバ変数の初期値を設定
//=============================================================================
HRESULT CTitle::Init()
{
	// サウンド情報の取得
	CSound *pSound = CApplication::GetSound();

	// タイトルBGMの再生
	pSound->PlaySound(CSound::SOUND_LABEL_TITELBGM);

	return S_OK;
}

//=============================================================================
// 終了
// Author : 唐﨑結斗
// 概要 : テクスチャのポインタと頂点バッファの解放
//=============================================================================
void CTitle::Uninit()
{
	// サウンド情報の取得
	CSound *pSound = CApplication::GetSound();

	// サウンド終了
	pSound->StopSound();

	// スコアの解放
	Release();
}

//=============================================================================
// 更新
// Author : 唐﨑結斗
// 概要 : 更新を行う
//=============================================================================
void CTitle::Update()
{
	// 入力情報の取得
	CKeyboard *pKeyboard = CApplication::GetKeyboard();

	// ジョイパッド 情報の取得
	CJoypad *pJoy = CApplication::GetJoy();

	if (pKeyboard->GetTrigger(DIK_RETURN))
	{
		CApplication::SetNextMode(CApplication::MODE_GAME);
	}

	//ゲット
	CDebugProc::Print("PersonCount Q or E: %d\n", Cnt);

	int nMaxPlayer = pJoy->GetUseJoyPad();

	if (pKeyboard->GetTrigger(DIK_Q))
	{
		Cnt++;
	}
	if (pKeyboard->GetTrigger(DIK_E))
	{
		Cnt--;
	}

	if (Cnt > nMaxPlayer)	//4を越えないよう
	{
		Cnt = 1;
	}
	if (Cnt < 1)	//マイナス設定無し
	{
		Cnt = nMaxPlayer;
	}

	CApplication::SetPersonCount(Cnt);

}

//=============================================================================
// 描画
// Author : 唐﨑結斗
// 概要 : 描画を行う
//=============================================================================
void CTitle::Draw()
{

}